RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b310f1024gq100.h
/* Bit fields for MSC BOOTLOADERCTRL */
#define _MSC_BOOTLOADERCTRL_RESETVALUE                    0x00000000UL                              /**< Default value for MSC_BOOTLOADERCTRL */
#define _MSC_BOOTLOADERCTRL_MASK                          0x00000003UL                              /**< Mask for MSC_BOOTLOADERCTRL */
#define MSC_BOOTLOADERCTRL_BLRDIS                         (0x1UL << 0)                              /**< Flash Bootloader Read Disable */
#define _MSC_BOOTLOADERCTRL_BLRDIS_SHIFT                  0                                         /**< Shift value for MSC_BLRDIS */
#define _MSC_BOOTLOADERCTRL_BLRDIS_MASK                   0x1UL                                     /**< Bit mask for MSC_BLRDIS */
#define _MSC_BOOTLOADERCTRL_BLRDIS_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for MSC_BOOTLOADERCTRL */
#define MSC_BOOTLOADERCTRL_BLRDIS_DEFAULT                 (_MSC_BOOTLOADERCTRL_BLRDIS_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_BOOTLOADERCTRL */
#define MSC_BOOTLOADERCTRL_BLWDIS                         (0x1UL << 1)                              /**< Flash Bootloader Write/Erase Disable */
#define _MSC_BOOTLOADERCTRL_BLWDIS_SHIFT                  1                                         /**< Shift value for MSC_BLWDIS */
#define _MSC_BOOTLOADERCTRL_BLWDIS_MASK                   0x2UL                                     /**< Bit mask for MSC_BLWDIS */
#define _MSC_BOOTLOADERCTRL_BLWDIS_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for MSC_BOOTLOADERCTRL */
#define MSC_BOOTLOADERCTRL_BLWDIS_DEFAULT                 (_MSC_BOOTLOADERCTRL_BLWDIS_DEFAULT << 1) /**< Shifted mode DEFAULT for MSC_BOOTLOADERCTRL */

/* Bit fields for MSC AAPUNLOCKCMD */
#define _MSC_AAPUNLOCKCMD_RESETVALUE                      0x00000000UL                               /**< Default value for MSC_AAPUNLOCKCMD */
#define _MSC_AAPUNLOCKCMD_MASK                            0x00000001UL                               /**< Mask for MSC_AAPUNLOCKCMD */
#define MSC_AAPUNLOCKCMD_UNLOCKAAP                        (0x1UL << 0)                               /**< Software Unlock AAP Command */
#define _MSC_AAPUNLOCKCMD_UNLOCKAAP_SHIFT                 0                                          /**< Shift value for MSC_UNLOCKAAP */
#define _MSC_AAPUNLOCKCMD_UNLOCKAAP_MASK                  0x1UL                                      /**< Bit mask for MSC_UNLOCKAAP */
#define _MSC_AAPUNLOCKCMD_UNLOCKAAP_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for MSC_AAPUNLOCKCMD */
#define MSC_AAPUNLOCKCMD_UNLOCKAAP_DEFAULT                (_MSC_AAPUNLOCKCMD_UNLOCKAAP_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_AAPUNLOCKCMD */

/* Bit fields for MSC CACHECONFIG0 */
#define _MSC_CACHECONFIG0_RESETVALUE                      0x00000003UL                                      /**< Default value for MSC_CACHECONFIG0 */
#define _MSC_CACHECONFIG0_MASK                            0x00000003UL                                      /**< Mask for MSC_CACHECONFIG0 */
#define _MSC_CACHECONFIG0_CACHELPLEVEL_SHIFT              0                                                 /**< Shift value for MSC_CACHELPLEVEL */
#define _MSC_CACHECONFIG0_CACHELPLEVEL_MASK               0x3UL                                             /**< Bit mask for MSC_CACHELPLEVEL */
#define _MSC_CACHECONFIG0_CACHELPLEVEL_BASE               0x00000000UL                                      /**< Mode BASE for MSC_CACHECONFIG0 */
#define _MSC_CACHECONFIG0_CACHELPLEVEL_ADVANCED           0x00000001UL                                      /**< Mode ADVANCED for MSC_CACHECONFIG0 */
#define _MSC_CACHECONFIG0_CACHELPLEVEL_DEFAULT            0x00000003UL                                      /**< Mode DEFAULT for MSC_CACHECONFIG0 */
#define _MSC_CACHECONFIG0_CACHELPLEVEL_MINACTIVITY        0x00000003UL                                      /**< Mode MINACTIVITY for MSC_CACHECONFIG0 */
#define MSC_CACHECONFIG0_CACHELPLEVEL_BASE                (_MSC_CACHECONFIG0_CACHELPLEVEL_BASE << 0)        /**< Shifted mode BASE for MSC_CACHECONFIG0 */
#define MSC_CACHECONFIG0_CACHELPLEVEL_ADVANCED            (_MSC_CACHECONFIG0_CACHELPLEVEL_ADVANCED << 0)    /**< Shifted mode ADVANCED for MSC_CACHECONFIG0 */
#define MSC_CACHECONFIG0_CACHELPLEVEL_DEFAULT             (_MSC_CACHECONFIG0_CACHELPLEVEL_DEFAULT << 0)     /**< Shifted mode DEFAULT for MSC_CACHECONFIG0 */
#define MSC_CACHECONFIG0_CACHELPLEVEL_MINACTIVITY         (_MSC_CACHECONFIG0_CACHELPLEVEL_MINACTIVITY << 0) /**< Shifted mode MINACTIVITY for MSC_CACHECONFIG0 */

/* Bit fields for MSC RAMCTRL */
#define _MSC_RAMCTRL_RESETVALUE                           0x00000000UL                                /**< Default value for MSC_RAMCTRL */
#define _MSC_RAMCTRL_MASK                                 0x00060606UL                                /**< Mask for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAMWSEN                               (0x1UL << 1)                                /**< RAM WAIT STATE Enable */
#define _MSC_RAMCTRL_RAMWSEN_SHIFT                        1                                           /**< Shift value for MSC_RAMWSEN */
#define _MSC_RAMCTRL_RAMWSEN_MASK                         0x2UL                                       /**< Bit mask for MSC_RAMWSEN */
#define _MSC_RAMCTRL_RAMWSEN_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAMWSEN_DEFAULT                       (_MSC_RAMCTRL_RAMWSEN_DEFAULT << 1)         /**< Shifted mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAMPREFETCHEN                         (0x1UL << 2)                                /**< RAM Prefetch Enable */
#define _MSC_RAMCTRL_RAMPREFETCHEN_SHIFT                  2                                           /**< Shift value for MSC_RAMPREFETCHEN */
#define _MSC_RAMCTRL_RAMPREFETCHEN_MASK                   0x4UL                                       /**< Bit mask for MSC_RAMPREFETCHEN */
#define _MSC_RAMCTRL_RAMPREFETCHEN_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAMPREFETCHEN_DEFAULT                 (_MSC_RAMCTRL_RAMPREFETCHEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAM1WSEN                              (0x1UL << 9)                                /**< RAM1 WAIT STATE Enable */
#define _MSC_RAMCTRL_RAM1WSEN_SHIFT                       9                                           /**< Shift value for MSC_RAM1WSEN */
#define _MSC_RAMCTRL_RAM1WSEN_MASK                        0x200UL                                     /**< Bit mask for MSC_RAM1WSEN */
#define _MSC_RAMCTRL_RAM1WSEN_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAM1WSEN_DEFAULT                      (_MSC_RAMCTRL_RAM1WSEN_DEFAULT << 9)        /**< Shifted mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAM1PREFETCHEN                        (0x1UL << 10)                               /**< RAM1 Prefetch Enable */
#define _MSC_RAMCTRL_RAM1PREFETCHEN_SHIFT                 10                                          /**< Shift value for MSC_RAM1PREFETCHEN */
#define _MSC_RAMCTRL_RAM1PREFETCHEN_MASK                  0x400UL                                     /**< Bit mask for MSC_RAM1PREFETCHEN */
#define _MSC_RAMCTRL_RAM1PREFETCHEN_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAM1PREFETCHEN_DEFAULT                (_MSC_RAMCTRL_RAM1PREFETCHEN_DEFAULT << 10) /**< Shifted mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAM2WSEN                              (0x1UL << 17)                               /**< RAM2 WAIT STATE Enable */
#define _MSC_RAMCTRL_RAM2WSEN_SHIFT                       17                                          /**< Shift value for MSC_RAM2WSEN */
#define _MSC_RAMCTRL_RAM2WSEN_MASK                        0x20000UL                                   /**< Bit mask for MSC_RAM2WSEN */
#define _MSC_RAMCTRL_RAM2WSEN_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAM2WSEN_DEFAULT                      (_MSC_RAMCTRL_RAM2WSEN_DEFAULT << 17)       /**< Shifted mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAM2PREFETCHEN                        (0x1UL << 18)                               /**< RAM2 Prefetch Enable */
#define _MSC_RAMCTRL_RAM2PREFETCHEN_SHIFT                 18                                          /**< Shift value for MSC_RAM2PREFETCHEN */
#define _MSC_RAMCTRL_RAM2PREFETCHEN_MASK                  0x40000UL                                   /**< Bit mask for MSC_RAM2PREFETCHEN */
#define _MSC_RAMCTRL_RAM2PREFETCHEN_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for MSC_RAMCTRL */
#define MSC_RAMCTRL_RAM2PREFETCHEN_DEFAULT                (_MSC_RAMCTRL_RAM2PREFETCHEN_DEFAULT << 18) /**< Shifted mode DEFAULT for MSC_RAMCTRL */

/* Bit fields for MSC ECCCTRL */
#define _MSC_ECCCTRL_RESETVALUE                           0x00000000UL                             /**< Default value for MSC_ECCCTRL */
#define _MSC_ECCCTRL_MASK                                 0x0000003FUL                             /**< Mask for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAMECCEWEN                            (0x1UL << 0)                             /**< RAM ECC Write Enable */
#define _MSC_ECCCTRL_RAMECCEWEN_SHIFT                     0                                        /**< Shift value for MSC_RAMECCEWEN */
#define _MSC_ECCCTRL_RAMECCEWEN_MASK                      0x1UL                                    /**< Bit mask for MSC_RAMECCEWEN */
#define _MSC_ECCCTRL_RAMECCEWEN_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAMECCEWEN_DEFAULT                    (_MSC_ECCCTRL_RAMECCEWEN_DEFAULT << 0)   /**< Shifted mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAMECCCHKEN                           (0x1UL << 1)                             /**< RAM ECC Check Enable */
#define _MSC_ECCCTRL_RAMECCCHKEN_SHIFT                    1                                        /**< Shift value for MSC_RAMECCCHKEN */
#define _MSC_ECCCTRL_RAMECCCHKEN_MASK                     0x2UL                                    /**< Bit mask for MSC_RAMECCCHKEN */
#define _MSC_ECCCTRL_RAMECCCHKEN_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAMECCCHKEN_DEFAULT                   (_MSC_ECCCTRL_RAMECCCHKEN_DEFAULT << 1)  /**< Shifted mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAM1ECCEWEN                           (0x1UL << 2)                             /**< RAM1 ECC Write Enable */
#define _MSC_ECCCTRL_RAM1ECCEWEN_SHIFT                    2                                        /**< Shift value for MSC_RAM1ECCEWEN */
#define _MSC_ECCCTRL_RAM1ECCEWEN_MASK                     0x4UL                                    /**< Bit mask for MSC_RAM1ECCEWEN */
#define _MSC_ECCCTRL_RAM1ECCEWEN_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAM1ECCEWEN_DEFAULT                   (_MSC_ECCCTRL_RAM1ECCEWEN_DEFAULT << 2)  /**< Shifted mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAM1ECCCHKEN                          (0x1UL << 3)                             /**< RAM1 ECC Check Enable */
#define _MSC_ECCCTRL_RAM1ECCCHKEN_SHIFT                   3                                        /**< Shift value for MSC_RAM1ECCCHKEN */
#define _MSC_ECCCTRL_RAM1ECCCHKEN_MASK                    0x8UL                                    /**< Bit mask for MSC_RAM1ECCCHKEN */
#define _MSC_ECCCTRL_RAM1ECCCHKEN_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAM1ECCCHKEN_DEFAULT                  (_MSC_ECCCTRL_RAM1ECCCHKEN_DEFAULT << 3) /**< Shifted mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAM2ECCEWEN                           (0x1UL << 4)                             /**< RAM2 ECC Write Enable */
#define _MSC_ECCCTRL_RAM2ECCEWEN_SHIFT                    4                                        /**< Shift value for MSC_RAM2ECCEWEN */
#define _MSC_ECCCTRL_RAM2ECCEWEN_MASK                     0x10UL                                   /**< Bit mask for MSC_RAM2ECCEWEN */
#define _MSC_ECCCTRL_RAM2ECCEWEN_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAM2ECCEWEN_DEFAULT                   (_MSC_ECCCTRL_RAM2ECCEWEN_DEFAULT << 4)  /**< Shifted mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAM2ECCCHKEN                          (0x1UL << 5)                             /**< RAM2 ECC Check Enable */
#define _MSC_ECCCTRL_RAM2ECCCHKEN_SHIFT                   5                                        /**< Shift value for MSC_RAM2ECCCHKEN */
#define _MSC_ECCCTRL_RAM2ECCCHKEN_MASK                    0x20UL                                   /**< Bit mask for MSC_RAM2ECCCHKEN */
#define _MSC_ECCCTRL_RAM2ECCCHKEN_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for MSC_ECCCTRL */
#define MSC_ECCCTRL_RAM2ECCCHKEN_DEFAULT                  (_MSC_ECCCTRL_RAM2ECCCHKEN_DEFAULT << 5) /**< Shifted mode DEFAULT for MSC_ECCCTRL */

/* Bit fields for MSC RAMECCADDR */
#define _MSC_RAMECCADDR_RESETVALUE                        0x00000000UL                              /**< Default value for MSC_RAMECCADDR */
#define _MSC_RAMECCADDR_MASK                              0xFFFFFFFFUL                              /**< Mask for MSC_RAMECCADDR */
#define _MSC_RAMECCADDR_RAMECCADDR_SHIFT                  0                                         /**< Shift value for MSC_RAMECCADDR */
#define _MSC_RAMECCADDR_RAMECCADDR_MASK                   0xFFFFFFFFUL                              /**< Bit mask for MSC_RAMECCADDR */
#define _MSC_RAMECCADDR_RAMECCADDR_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for MSC_RAMECCADDR */
#define MSC_RAMECCADDR_RAMECCADDR_DEFAULT                 (_MSC_RAMECCADDR_RAMECCADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_RAMECCADDR */

/* Bit fields for MSC RAM1ECCADDR */
#define _MSC_RAM1ECCADDR_RESETVALUE                       0x00000000UL                                /**< Default value for MSC_RAM1ECCADDR */
#define _MSC_RAM1ECCADDR_MASK                             0xFFFFFFFFUL                                /**< Mask for MSC_RAM1ECCADDR */
#define _MSC_RAM1ECCADDR_RAM1ECCADDR_SHIFT                0                                           /**< Shift value for MSC_RAM1ECCADDR */
#define _MSC_RAM1ECCADDR_RAM1ECCADDR_MASK                 0xFFFFFFFFUL                                /**< Bit mask for MSC_RAM1ECCADDR */
#define _MSC_RAM1ECCADDR_RAM1ECCADDR_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for MSC_RAM1ECCADDR */
#define MSC_RAM1ECCADDR_RAM1ECCADDR_DEFAULT               (_MSC_RAM1ECCADDR_RAM1ECCADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_RAM1ECCADDR */

/* Bit fields for MSC RAM2ECCADDR */
#define _MSC_RAM2ECCADDR_RESETVALUE                       0x00000000UL                                /**< Default value for MSC_RAM2ECCADDR */
#define _MSC_RAM2ECCADDR_MASK                             0xFFFFFFFFUL                                /**< Mask for MSC_RAM2ECCADDR */
#define _MSC_RAM2ECCADDR_RAM2ECCADDR_SHIFT                0                                           /**< Shift value for MSC_RAM2ECCADDR */
#define _MSC_RAM2ECCADDR_RAM2ECCADDR_MASK                 0xFFFFFFFFUL                                /**< Bit mask for MSC_RAM2ECCADDR */
#define _MSC_RAM2ECCADDR_RAM2ECCADDR_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for MSC_RAM2ECCADDR */
#define MSC_RAM2ECCADDR_RAM2ECCADDR_DEFAULT               (_MSC_RAM2ECCADDR_RAM2ECCADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for MSC_RAM2ECCADDR */

/** @} */
/** @} End of group EFM32GG12B310F1024GQ100_MSC */

/***************************************************************************//**
 * @addtogroup EFM32GG12B310F1024GQ100_EMU
 * @{
 * @defgroup EFM32GG12B310F1024GQ100_EMU_BitFields  EMU Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for EMU CTRL */
#define _EMU_CTRL_RESETVALUE                                 0x00000000UL                                /**< Default value for EMU_CTRL */
#define _EMU_CTRL_MASK                                       0x0003031EUL                                /**< Mask for EMU_CTRL */
#define EMU_CTRL_EM2BLOCK                                    (0x1UL << 1)                                /**< Energy Mode 2 Block */
#define _EMU_CTRL_EM2BLOCK_SHIFT                             1                                           /**< Shift value for EMU_EM2BLOCK */
#define _EMU_CTRL_EM2BLOCK_MASK                              0x2UL                                       /**< Bit mask for EMU_EM2BLOCK */
#define _EMU_CTRL_EM2BLOCK_DEFAULT                           0x00000000UL                                /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM2BLOCK_DEFAULT                            (_EMU_CTRL_EM2BLOCK_DEFAULT << 1)           /**< Shifted mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM2BODDIS                                   (0x1UL << 2)                                /**< Disable BOD in EM2 */
#define _EMU_CTRL_EM2BODDIS_SHIFT                            2                                           /**< Shift value for EMU_EM2BODDIS */
#define _EMU_CTRL_EM2BODDIS_MASK                             0x4UL                                       /**< Bit mask for EMU_EM2BODDIS */
#define _EMU_CTRL_EM2BODDIS_DEFAULT                          0x00000000UL                                /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM2BODDIS_DEFAULT                           (_EMU_CTRL_EM2BODDIS_DEFAULT << 2)          /**< Shifted mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM01LD                                      (0x1UL << 3)                                /**< Reserved for internal use. Do not change. */
#define _EMU_CTRL_EM01LD_SHIFT                               3                                           /**< Shift value for EMU_EM01LD */
#define _EMU_CTRL_EM01LD_MASK                                0x8UL                                       /**< Bit mask for EMU_EM01LD */
#define _EMU_CTRL_EM01LD_DEFAULT                             0x00000000UL                                /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM01LD_DEFAULT                              (_EMU_CTRL_EM01LD_DEFAULT << 3)             /**< Shifted mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM23VSCALEAUTOWSEN                          (0x1UL << 4)                                /**< Automatically Configures Flash and Frequency to Wakeup From EM2 or EM3 at Low Voltage */
#define _EMU_CTRL_EM23VSCALEAUTOWSEN_SHIFT                   4                                           /**< Shift value for EMU_EM23VSCALEAUTOWSEN */
#define _EMU_CTRL_EM23VSCALEAUTOWSEN_MASK                    0x10UL                                      /**< Bit mask for EMU_EM23VSCALEAUTOWSEN */
#define _EMU_CTRL_EM23VSCALEAUTOWSEN_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM23VSCALEAUTOWSEN_DEFAULT                  (_EMU_CTRL_EM23VSCALEAUTOWSEN_DEFAULT << 4) /**< Shifted mode DEFAULT for EMU_CTRL */
#define _EMU_CTRL_EM23VSCALE_SHIFT                           8                                           /**< Shift value for EMU_EM23VSCALE */
#define _EMU_CTRL_EM23VSCALE_MASK                            0x300UL                                     /**< Bit mask for EMU_EM23VSCALE */
#define _EMU_CTRL_EM23VSCALE_DEFAULT                         0x00000000UL                                /**< Mode DEFAULT for EMU_CTRL */
#define _EMU_CTRL_EM23VSCALE_VSCALE2                         0x00000000UL                                /**< Mode VSCALE2 for EMU_CTRL */
#define _EMU_CTRL_EM23VSCALE_VSCALE0                         0x00000002UL                                /**< Mode VSCALE0 for EMU_CTRL */
#define _EMU_CTRL_EM23VSCALE_RESV                            0x00000003UL                                /**< Mode RESV for EMU_CTRL */
#define EMU_CTRL_EM23VSCALE_DEFAULT                          (_EMU_CTRL_EM23VSCALE_DEFAULT << 8)         /**< Shifted mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM23VSCALE_VSCALE2                          (_EMU_CTRL_EM23VSCALE_VSCALE2 << 8)         /**< Shifted mode VSCALE2 for EMU_CTRL */
#define EMU_CTRL_EM23VSCALE_VSCALE0                          (_EMU_CTRL_EM23VSCALE_VSCALE0 << 8)         /**< Shifted mode VSCALE0 for EMU_CTRL */
#define EMU_CTRL_EM23VSCALE_RESV                             (_EMU_CTRL_EM23VSCALE_RESV << 8)            /**< Shifted mode RESV for EMU_CTRL */
#define _EMU_CTRL_EM4HVSCALE_SHIFT                           16                                          /**< Shift value for EMU_EM4HVSCALE */
#define _EMU_CTRL_EM4HVSCALE_MASK                            0x30000UL                                   /**< Bit mask for EMU_EM4HVSCALE */
#define _EMU_CTRL_EM4HVSCALE_DEFAULT                         0x00000000UL                                /**< Mode DEFAULT for EMU_CTRL */
#define _EMU_CTRL_EM4HVSCALE_VSCALE2                         0x00000000UL                                /**< Mode VSCALE2 for EMU_CTRL */
#define _EMU_CTRL_EM4HVSCALE_VSCALE0                         0x00000002UL                                /**< Mode VSCALE0 for EMU_CTRL */
#define _EMU_CTRL_EM4HVSCALE_RESV                            0x00000003UL                                /**< Mode RESV for EMU_CTRL */
#define EMU_CTRL_EM4HVSCALE_DEFAULT                          (_EMU_CTRL_EM4HVSCALE_DEFAULT << 16)        /**< Shifted mode DEFAULT for EMU_CTRL */
#define EMU_CTRL_EM4HVSCALE_VSCALE2                          (_EMU_CTRL_EM4HVSCALE_VSCALE2 << 16)        /**< Shifted mode VSCALE2 for EMU_CTRL */
#define EMU_CTRL_EM4HVSCALE_VSCALE0                          (_EMU_CTRL_EM4HVSCALE_VSCALE0 << 16)        /**< Shifted mode VSCALE0 for EMU_CTRL */
#define EMU_CTRL_EM4HVSCALE_RESV                             (_EMU_CTRL_EM4HVSCALE_RESV << 16)           /**< Shifted mode RESV for EMU_CTRL */

